#### Commercial

```console
% make testacc TEST=./aws TESTARGS='-run=TestAccAWSServiceCatalogProvisionedProduct_'        
==> Checking that code complies with gofmt requirements...
TF_ACC=1 go test ./aws -v -count 1 -parallel 20 -run=TestAccAWSServiceCatalogProvisionedProduct_ -timeout 180m
=== RUN   TestAccAWSServiceCatalogProvisionedProduct_basic
=== PAUSE TestAccAWSServiceCatalogProvisionedProduct_basic
=== RUN   TestAccAWSServiceCatalogProvisionedProduct_disappears
=== PAUSE TestAccAWSServiceCatalogProvisionedProduct_disappears
=== RUN   TestAccAWSServiceCatalogProvisionedProduct_tags
=== PAUSE TestAccAWSServiceCatalogProvisionedProduct_tags
=== CONT  TestAccAWSServiceCatalogProvisionedProduct_basic
=== CONT  TestAccAWSServiceCatalogProvisionedProduct_tags
=== CONT  TestAccAWSServiceCatalogProvisionedProduct_disappears
=== CONT  TestAccAWSServiceCatalogProvisionedProduct_tags
    resource_aws_servicecatalog_provisioned_product_test.go:152: Step 1/2 error: After applying this test step and performing a `terraform refresh`, the plan was not empty.
        stdout
        
        
        An execution plan has been generated and is shown below.
        Resource actions are indicated with the following symbols:
          ~ update in-place
         <= read (data resources)
        
        Terraform will perform the following actions:
        
          # data.aws_servicecatalog_launch_paths.test will be read during apply
          # (config refers to values not yet known)
         <= data "aws_servicecatalog_launch_paths" "test"  {
              + id         = (known after apply)
              + product_id = "prod-rw4zuf535uqf6"
              + summaries  = (known after apply)
            }
        
          # aws_servicecatalog_provisioned_product.test will be updated in-place
          ~ resource "aws_servicecatalog_provisioned_product" "test" {
                accept_language                        = "en"
                arn                                    = "arn:aws:servicecatalog:us-west-2:123456789012:stack/tf-acc-test-2618779816860699371/pp-7p7qdcwh73jva"
                cloudwatch_dashboard_names             = []
                created_time                           = "2021-06-29T20:56:04Z"
                id                                     = "pp-7p7qdcwh73jva"
                ignore_errors                          = false
                last_provisioning_record_id            = "rec-5dlqikngi6it4"
                last_record_id                         = "rec-5dlqikngi6it4"
                last_successful_provisioning_record_id = "rec-5dlqikngi6it4"
                name                                   = "tf-acc-test-2618779816860699371"
              ~ path_id                                = "lpv2-wpmae6hbx3bdu" -> (known after apply)
                product_id                             = "prod-rw4zuf535uqf6"
                provisioning_artifact_id               = "pa-6s254ercj2kcs"
                provisioning_artifact_name             = "tf-acc-test-2618779816860699371"
                retain_physical_resources              = false
                status                                 = "AVAILABLE"
                tags                                   = {
                    "Name" = "tf-acc-test-2618779816860699371"
                }
                tags_all                               = {
                    "Name" = "tf-acc-test-2618779816860699371"
                }
                type                                   = "CFN_STACK"
            }
        
        Plan: 0 to add, 1 to change, 0 to destroy.
=== CONT  TestAccAWSServiceCatalogProvisionedProduct_basic
    resource_aws_servicecatalog_provisioned_product_test.go:87: Step 1/2 error: After applying this test step and performing a `terraform refresh`, the plan was not empty.
        stdout
        
        
        An execution plan has been generated and is shown below.
        Resource actions are indicated with the following symbols:
          ~ update in-place
         <= read (data resources)
        
        Terraform will perform the following actions:
        
          # data.aws_servicecatalog_launch_paths.test will be read during apply
          # (config refers to values not yet known)
         <= data "aws_servicecatalog_launch_paths" "test"  {
              + id         = (known after apply)
              + product_id = "prod-7mbvsqqix3stm"
              + summaries  = (known after apply)
            }
        
          # aws_servicecatalog_provisioned_product.test will be updated in-place
          ~ resource "aws_servicecatalog_provisioned_product" "test" {
                accept_language                        = "en"
                arn                                    = "arn:aws:servicecatalog:us-west-2:123456789012:stack/tf-acc-test-3116841020422433565/pp-ytul2yguj4m4o"
                cloudwatch_dashboard_names             = []
                created_time                           = "2021-06-29T20:56:05Z"
                id                                     = "pp-ytul2yguj4m4o"
                ignore_errors                          = false
                last_provisioning_record_id            = "rec-vb5arr4rekfss"
                last_record_id                         = "rec-vb5arr4rekfss"
                last_successful_provisioning_record_id = "rec-vb5arr4rekfss"
                name                                   = "tf-acc-test-3116841020422433565"
              ~ path_id                                = "lpv2-22c3vifnotore" -> (known after apply)
                product_id                             = "prod-7mbvsqqix3stm"
                provisioning_artifact_id               = "pa-zr2zi6nqk2e6u"
                provisioning_artifact_name             = "tf-acc-test-3116841020422433565"
                retain_physical_resources              = false
                status                                 = "AVAILABLE"
                tags                                   = {}
                tags_all                               = {}
                type                                   = "CFN_STACK"
            }
        
        Plan: 0 to add, 1 to change, 0 to destroy.
--- PASS: TestAccAWSServiceCatalogProvisionedProduct_disappears (110.41s)
--- FAIL: TestAccAWSServiceCatalogProvisionedProduct_tags (112.06s)
--- FAIL: TestAccAWSServiceCatalogProvisionedProduct_basic (112.77s)
FAIL
FAIL	github.com/terraform-providers/terraform-provider-aws/aws	115.958s
FAIL
make: *** [testacc] Error 1
```

Similar error to https://github.com/hashicorp/terraform-provider-aws/pull/20001#issuecomment-870907952.